InformationRegisters/КлиентыСтационара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КлиентыСтационара</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПоступления</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаУсловийПребывания</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыДвиженияВСтационаре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДвиженияВСтационаре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзменениеУсловий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводМеждуПодразделениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выписка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыОбращений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыОбращений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеОбработан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переведен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ДоговорСКлиентом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ДоговорСКлиентом</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/НаправлениеСтационар.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>НаправлениеСтационар</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Диагноз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Диагнозы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчреждениеНаправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбоснованиеНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВрачНаправивший</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаведующийОтделением</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/УстановкаУсловийПребывания.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УстановкаУсловийПребывания</Name>
			<Comment>Установка условий пребывания в стационаре</Comment>
			<BasedOn>
				<xr:Item>Document.ОбращениеВСтационар</xr:Item>
				<xr:Item>Document.БронированиеКойкоМеста</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УсловияПребывания</xr:Item>
				<xr:Item>InformationRegister.омг_ТекущиеМедицинскиеКарты</xr:Item>
				<xr:Item>InformationRegister.СостояниеКойкоМеста</xr:Item>
				<xr:Item>InformationRegister.КлиентыСтационара</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженияВСтационаре</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Палата</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Палаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОбращения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОбращениеВСтационар</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прейскурант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Прейскуранты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Полис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраховыеПолисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КойкоМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КойкоМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>омг_МедицинскаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МедицинскиеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Номенклатура</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonForms/АРМПостовойМедсестры/Ext/Form/Module.bsl
#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Изменения Макеев 13-12-2025 (
	// Перенесено в ПриОткрытии
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Изменения Макеев 13-12-2025 (
	ТекущиеПациенты = ПолучитьТекущихПациентовСтационара(Истина, омг_Филиалы, омг_Отделения);
	Для Каждого СтрокаТекущегоПациента Из ТекущиеПациенты Цикл
		
		ЗаполнитьЗначенияСвойств(ПациентыВСтационаре.Добавить(), СтрокаТекущегоПациента);
		
	КонецЦикла;
	ОтборСегодняшниеОбращения(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "УстановкаУсловийПребывания" Тогда 
		//***
		Элементы.СписокОбращений.Обновить();
		ОбновитьСписокТекущихПациентовСтационара(Неопределено);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДоговорыКлиента(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаОбращения Тогда
		ТекущиеДанные = Элементы.СписокОбращений.ТекущиеДанные;
	Иначе
		ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
	КонецЕсли;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Если ЗначениеЗаполнено(ТекущиеДанные.Клиент) Тогда
			ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Клиент", ТекущиеДанные.Клиент));
			ОткрытьФорму("Документ.ДоговорСКлиентом.ФормаСписка",ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНаправление(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаОбращения Тогда
		
		ТекущиеДанные = Элементы.СписокОбращений.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			Если ЗначениеЗаполнено(ТекущиеДанные.Клиент) Тогда
				ЗначенияЗаполнения = Новый Структура("Клиент,ВрачНаправивший,Диагноз,МедицинскаяКарта", ТекущиеДанные.Клиент,ТекущиеДанные.ЛечащийВрач, ТекущиеДанные.ДиагнозПоступления, ТекущиеДанные.МедицинскаяКарта);
				ОткрытьФорму("Документ.НаправлениеСтационар.ФормаОбъекта",Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения));
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПациентыВСтационаре Тогда
		
		ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ЗначенияЗаполнения = Новый Структура("Клиент", ТекущиеДанные.Клиент);
			
			ДокументОбращения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущиеДанные.ДокументПоступления, "ДокументОбращения");
			Если ЗначениеЗаполнено(ДокументОбращения) Тогда
				РеквизитыОбращения = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументОбращения, "ЛечащийВрач,ДиагнозПоступления,МедицинскаяКарта");
				ЗначенияЗаполнения.Вставить("ВрачНаправивший",	РеквизитыОбращения.ЛечащийВрач);
				ЗначенияЗаполнения.Вставить("Диагноз",			РеквизитыОбращения.ДиагнозПоступления);
				ЗначенияЗаполнения.Вставить("МедицинскаяКарта", РеквизитыОбращения.МедицинскаяКарта);
			КонецЕсли;
			
			ОткрытьФорму("Документ.НаправлениеСтационар.ФормаОбъекта",Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения));
		КонецЕсли;
			
	КонецЕсли;
	
	ОткрытьФорму("Документ.НаправлениеСтационар.ФормаОбъекта");		
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументДвиженияВСтационаре(ВидОперации)
	
	ЗначенияЗаполнения = Новый Структура;
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаОбращения	Тогда
		
		ТекущиеДанные = Элементы.СписокОбращений.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			
			СтрокиПоступления = ПациентыВСтационаре.НайтиСтроки(Новый Структура("ДокументОбращения", Элементы.СписокОбращений.ТекущаяСтрока));
			Если СтрокиПоступления.Количество() = 0 Тогда
				
				ЗначенияЗаполнения = Новый Структура("Клиент,МедицинскаяКарта", ТекущиеДанные.Клиент,ТекущиеДанные.МедицинскаяКарта);
				Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.Поступление") Тогда
					ЗначенияЗаполнения.Вставить("ДокументОбращения", Элементы.СписокОбращений.ТекущаяСтрока);
				КонецЕсли;
			Иначе
				Если ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.Поступление") Тогда
					ВариантыОтвета = Новый СписокЗначений;
					ВариантыОтвета.Добавить(1, "Открыть существующий");
					ВариантыОтвета.Добавить(2, "Создать новый");
					ВариантыОтвета.Добавить(3, "Отмена");
					Ответ = Вопрос(	"По выбранному обращению уже есть документ поступления в стационар.
									|Открыть это поступление или создать новое?", ВариантыОтвета, 30, ВариантыОтвета[2].Значение);
					Если Ответ = 1 Тогда
						ОткрытьЗначение(СтрокиПоступления[0].ДокументПоступления);
						Возврат;
					ИначеЕсли Ответ = 3 Тогда
						Возврат;
					КонецЕсли;
				Иначе
					ЗначенияЗаполнения = Новый Структура("Клиент,МедицинскаяКарта", ТекущиеДанные.Клиент,ТекущиеДанные.МедицинскаяКарта);
				КонецЕсли;
				
			КонецЕсли;
		КонецЕсли;
			
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПациентыВСтационаре
		И ВидОперации <> ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.Поступление")
	Тогда
		
		ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			
			ЗначенияЗаполнения = Новый Структура("Клиент", ТекущиеДанные.Клиент);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗначенияЗаполнения.Вставить("ВидОперации", ВидОперации);
	ОткрытьФорму("Документ.УстановкаУсловийПребывания.ФормаОбъекта",Новый Структура("ЗначенияЗаполнения",ЗначенияЗаполнения));
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьПоступлениеИзменениеВыписку(Команда)
	
	Если Команда = Команды.Найти("СоздатьПоступление") Тогда
		
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.Поступление");
		
	ИначеЕсли Команда = Команды.Найти("СоздатьИзменениеУсловий") Тогда
		
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.ИзменениеУсловий");
		
	ИначеЕсли Команда = Команды.Найти("СоздатьПереводМеждуПодразделениями") Тогда
		
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.ПереводМеждуПодразделениями");
		
	ИначеЕсли Команда = Команды.Найти("СоздатьВыписку") Тогда
		
		ВидОперации = ПредопределенноеЗначение("Перечисление.ВидыДвиженияВСтационаре.Выписка");
		
	Иначе
		Возврат;
	КонецЕсли;
	
	СоздатьДокументДвиженияВСтационаре(ВидОперации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборОбращенийПоФилиалам()
	
	Если Не омг_Филиалы.Количество() = 0 Тогда
		РаботаСФормамиКлиент.УстановитьОтборСписка("Филиал", омг_Филиалы, СписокОбращений, ВидСравненияКомпоновкиДанных.ВСписке);
	Иначе
		РаботаСФормамиКлиент.СнятьОтборСписка("Филиал", СписокОбращений);
	КонецЕсли;
	Если Не омг_Отделения.Количество() = 0 Тогда
		РаботаСФормамиКлиент.УстановитьОтборСписка("Подразделение", омг_Отделения, СписокОбращений, ВидСравненияКомпоновкиДанных.ВСписке);
	Иначе
		РаботаСФормамиКлиент.СнятьОтборСписка("Подразделение", СписокОбращений);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборСегодняшниеОбращения(Команда)
	
	// Изменения Макеевв 13-12-2025 (
	Элементы.ОтборСегодняшниеОбращения.Пометка = Не Элементы.ОтборСегодняшниеОбращения.Пометка;
	
	Если Элементы.ОтборСегодняшниеОбращения.Пометка Тогда
		РаботаСФормамиКлиент.УстановитьОтборСписка("Дата", ТекущаяДата()-86400, СписокОбращений, ВидСравненияКомпоновкиДанных.БольшеИлиРавно);
	Иначе
		РаботаСФормамиКлиент.СнятьОтборСписка("Дата", СписокОбращений);
	КонецЕсли;
	ОтборОбращенийПоФилиалам();
	
КонецПроцедуры

&НаКлиенте
Процедура Необработанные(Команда)
	
	УстановитьОтбор(ПредопределенноеЗначение("Перечисление.СтатусыОбращений.НеОбработан"));	
	Элементы.СписокОбращений.Обновить();
		
КонецПроцедуры

&НаКлиенте
Процедура Принятые(Команда)
	УстановитьОтбор(ПредопределенноеЗначение("Перечисление.СтатусыОбращений.Принят"));	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтбор(ЗначениеОтбора)
	
	РаботаСФормамиСервер.СнятьОтборСписка("Статус",СписокОбращений);
	РаботаСФормамиСервер.УстановитьОтборСписка("Статус", ЗначениеОтбора,СписокОбращений);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОУ(Команда)
	
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаСтраницаОбращения Тогда
	
		ТекущиеДанные = Элементы.СписокОбращений.ТекущиеДанные;
			
	ИначеЕсли Элементы.ГруппаСтраницы.ТекущаяСтраница = Элементы.ГруппаПациентыВСтационаре Тогда
		
		ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
			
	КонецЕсли;	
	
	Если ТекущиеДанные = Неопределено Тогда
		ПараметрыФормы = Неопределено;
	Иначе
		ПараметрыФормы = Новый Структура("Клиент",ТекущиеДанные.Клиент);
	КонецЕсли;
	
	ФормаСозданияОУ = ОткрытьФорму("ОбщаяФорма.ФормаСозданияОУВСтационаре", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокТекущихПациентовСтационара(Команда)
	
	// Изменения Макеев 13-12-2025 (
	ПациентыВСтационаре.Очистить();
	
	ТекущиеПациенты = ПолучитьТекущихПациентовСтационара(Истина, омг_Филиалы, омг_Отделения);
	Для Каждого СтрокаТекущегоПациента Из ТекущиеПациенты Цикл
		
		ЗаполнитьЗначенияСвойств(ПациентыВСтационаре.Добавить(), СтрокаТекущегоПациента);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьТекущихПациентовСтационара(ДляОбработкиНаКлиенте, Знач омг_Филиалы, Знач омг_Отделения)
	
	// Изменения Макеев 13-12-2025 (
	
	ДополнительныеПоляЗапроса = Новый СписокЗначений;
	ДополнительныеПоляЗапроса.Добавить("Пациент", "Клиент");
	ДополнительныеПоляЗапроса.Добавить("ДатаРождения", "Клиент.ДатаРождения");
	ДополнительныеПоляЗапроса.Добавить("ДиагнозПоступления", "ДокументПоступления.ДокументОбращения.ДиагнозПоступления");
	ДополнительныеПоляЗапроса.Добавить("МедицинскаяКарта", "ДокументПоступления.ДокументОбращения.МедицинскаяКарта");
	
	ДополнительныеУсловия = Новый Массив;
	
	Если Не омг_Отделения.Количество() = 0 Тогда
		ТекстЗапроса = "КлиентыСтационара.КойкоМесто.Владелец.Подразделение В (&Подразделения)";
		ПараметрЗапроса = Новый Структура("Подразделения", омг_Отделения);
		ДополнительныеУсловия.Добавить(Новый Структура("Текст, Параметры", ТекстЗапроса, ПараметрЗапроса));
	КонецЕсли;
	
	Если Не омг_Филиалы.Количество() = 0 Тогда
		ТекстЗапроса = "Регистратор.Филиал В (&Филиалы)";
		ПараметрЗапроса = Новый Структура("Филиалы", омг_Филиалы);
		ДополнительныеУсловия.Добавить(Новый Структура("Текст, Параметры", ТекстЗапроса, ПараметрЗапроса));
	КонецЕсли;
	
	ТаблицаПациентов = Стационар.ПолучитьКлиентовСтационара(ТекущаяДата(),,ДополнительныеПоляЗапроса, ДополнительныеУсловия);
	
	Если ДляОбработкиНаКлиенте Тогда
		Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаПациентов);
	Иначе
		Возврат ТаблицаПациентов;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ПациентыВСтационареВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = ПациентыВСтационаре.НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	Если Поле = Элементы.ПациентыВСтационареДатаПоследнегоИзменения Тогда
		ОткрытьЗначение(ТекущиеДанные.ДокументИзмененияРазмещения);
	Иначе
		ОткрытьЗначение(ТекущиеДанные.ДокументПоступления);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияПребыванияПациента(Команда)
	
	ТекущиеДанные = Элементы.ПациентыВСтационаре.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ПараметрыФормы = Новый Структура("Отбор", Новый Структура("Клиент", ТекущиеДанные.Клиент));
		ОткрытьФорму("РегистрСведений.КлиентыСтационара.ФормаСписка", ПараметрыФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Отбор = Новый Структура;//("Организация", Объект.омг_Организация);
	СписокВыбранных = омг_Филиалы;
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "Филиалы", СписокВыбранных, Отбор), Элементы.омг_Филиалы,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ОтделенияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокВыбранных = омг_Отделения;

	Отбор = Новый Структура;//("Организация", Объект.омг_Организация);
	
	ПараметрыЗапроса = Новый Массив;
	ПараметрыЗапроса.Добавить(Новый Структура("Параметр, Значение", "Филиалы", омг_Филиалы.ВыгрузитьЗначения()));
	
	Отбор.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	
	СложныеОтборы = Новый Массив;
	Если Не омг_Филиалы.Количество() = 0 Тогда
		СложныеОтборы.Добавить("Филиал В (&Филиалы)");
	КонецЕсли;
	
	Отбор.Вставить("СложныеОтборы", СложныеОтборы);
	ОткрытьФорму("ОбщаяФорма.омг_ФормаВыбораСИерархией", 
		Новый Структура("Справочник, СписокВыбранных, Отбор", "Подразделения", СписокВыбранных, Отбор), Элементы.омг_Отделения,
		УникальныйИдентификатор,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	омг_Филиалы = ВыбранноеЗначение;
	
	ОбновитьСписокТекущихПациентовСтационара(Неопределено);
	ОтборОбращенийПоФилиалам();
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ОтделенияОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	омг_Отделения = ВыбранноеЗначение;
	
	ОбновитьСписокТекущихПациентовСтационара(Неопределено);
	ОтборОбращенийПоФилиалам();
	
КонецПроцедуры

&НаКлиенте
Процедура омг_ФилиалыПриИзменении(Элемент)
	
	Если Не омг_Филиалы.Количество() = 0 Тогда
		омг_Отделения.Очистить();
	КонецЕсли;
	ОбновитьСписокТекущихПациентовСтационара(Неопределено);
	ОтборОбращенийПоФилиалам();

КонецПроцедуры

&НаКлиенте
Процедура омг_ОтделенияПриИзменении(Элемент)

	ОбновитьСписокТекущихПациентовСтационара(Неопределено);
	ОтборОбращенийПоФилиалам();

КонецПроцедуры
